PIPE/STRATEGY_III/CASE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
  =========                 |
        /  F ield         | OpenFOAM: The Open Source CFD Toolbox
       /   O peration     | Website:  https://openfoam.org
      /    A nd           | Version:  8
     /     M anipulation  |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (200 0 0)
    (200 9.999905e-01 4.363309e-03)
    (0 9.999905e-01 4.363309e-03)
    (0 9.999905e-01 -4.363309e-03)
    (200 9.999905e-01 -4.363309e-03)
);

blocks
(
   hex (0 1 5 4 0 1 2 3) (1024 144 1) simpleGrading (1 0.005425 1)
);

edges
(
    arc 3 4(0 1 0)
    arc 2 5(150 1 0)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 2 1)
        );
    }
    pipe
    {
        type wall;
        faces
        (
            (3 2 5 4)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 4 5 1)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }
       
);

mergePatchPairs
(
);
// ************************************************************************* //
